In [14]:
!pip install pandas

Requirement already satisfied: pandas in ./opt/anaconda3/lib/python3.8/site-packages (1.0.5)
Requirement already satisfied: python-dateutil>=2.6.1 in ./opt/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in ./opt/anaconda3/lib/python3.8/site-packages (from pandas) (1.18.5)
Requirement already satisfied: pytz>=2017.2 in ./opt/anaconda3/lib/python3.8/site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in ./opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)

In [18]:
!pip install numpy

Requirement already satisfied: numpy in ./opt/anaconda3/lib/python3.8/site-packages (1.18.5)

In [1]:
import pandas as pd
import numpy as np

In [2]:
#load data
data = pd.read_csv('crx.data', header = None)

In [3]:
#create some variable names for our dataset
varnames = ['A'+str(s) for s in range (1,17)]

In [4]:
#add column names
data.columns = varnames

In [5]:
#replace ? with np.nan
data = data.replace('?', np.nan)

In [6]:
#re-cast some variable types to its correct type
data['A2'] = data['A2'].astype('float')

In [7]:
#encode target to binary
data['A16'] = data['A16'].map({'+':1, '-':0})

In [8]:
data.info() #data types of columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 690 entries, 0 to 689
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A1      678 non-null    object
 1   A2      678 non-null    float64
 2   A3      690 non-null    float64
 3   A4      684 non-null    object
 4   A5      684 non-null    object
 5   A6      681 non-null    object
 6   A7      681 non-null    object
 7   A8      690 non-null    float64
 8   A9      690 non-null    object
 9   A10     690 non-null    object
 10  A11     690 non-null    int64
 11  A12     690 non-null    object
 12  A13     690 non-null    object
 13  A14     677 non-null    object
 14  A15     690 non-null    int64
 15  A16     690 non-null    int64
dtypes: float64(3), int64(3), object(10)
memory usage: 86.4+ KB

In [9]:
data.head()

  A1     A2     A3 A4 A5 A6 A7    A8 A9 A10  A11 A12 A13    A14  A15  A16
0  b  30.83  0.000  u  g  w  v  1.25  t   t    1   f   g  00202    0    1
1  a  58.67  4.460  u  g  q  h  3.04  t   t    6   f   g  00043  560    1
2  a  24.50  0.500  u  g  q  h  1.50  t   f    0   f   g  00280  824    1
3  b  27.83  1.540  u  g  w  v  3.75  t   t    5   t   g  00100    3    1
4  b  20.17  5.625  u  g  w  v  1.71  t   f    0   f   s  00120    0    1

In [10]:
data.tail()
data.tail(10)

,A1,A2,A3,A4,A5,A6,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
680,b,19.50,0.290,u,g,k,v,0.290,f,f,0,f,g,00280,364,0
681,b,27.83,1.000,y,p,d,h,3.000,f,f,0,f,g,00176,537,0
682,b,17.08,3.290,u,g,i,v,0.335,f,f,0,t,g,00140,2,0
683,b,36.42,0.750,y,p,d,v,0.585,f,f,0,f,g,00240,3,0
684,b,40.58,3.290,u,g,m,v,3.500,f,f,0,t,s,00400,0,0
685,b,21.08,10.085,y,p,e,h,1.250,f,f,0,f,g,00260,0,0
686,a,22.67,0.750,u,g,c,v,2.000,f,t,2,t,g,00200,394,0
687,a,25.25,13.500,y,p,ff,ff,2.000,f,t,1,t,g,00200,1,0
688,b,17.92,0.205,u,g,aa,v,0.040,f,f,0,f,g,00280,750,0
689,b,35.00,3.375,u,g,c,h,8.290,f,f,0,t,g,00000,0,0

In [11]:
#save the data 
data.to_csv('creditApproval.csv', index = False)

In [12]:
#find the categorical variables 
cat_columns = [c for c in data.columns if data[c].dtypes =='O']

In [13]:
data[cat_columns].head()

  A1 A4 A5 A6 A7 A9 A10 A12 A13    A14
0  b  u  g  w  v  t   t   f   g  00202
1  a  u  g  q  h  t   t   f   g  00043
2  a  u  g  q  h  t   f   f   g  00280
3  b  u  g  w  v  t   t   t   g  00100
4  b  u  g  w  v  t   f   f   s  00120

In [14]:
#find the non categorical variables 
cat_columns = [c for c in data.columns if data[c].dtypes !='O']

In [15]:
#TASK 2 VARIABLES
#loading of data set
data = pd.read_csv('loan.csv')

In [16]:
data.head()

,customer_id,disbursed_amount,interest,market,employment,time_employed,householder,income,date_issued,target,loan_purpose,number_open_accounts,date_last_payment,number_credit_lines_12
0,0,23201.5,15.4840,C,Teacher,<=5 years,RENT,84600.0,2013-06-11,0,Debt consolidation,4.0,2016-01-14,NaN
1,1,7425.0,11.2032,B,Accountant,<=5 years,OWNER,102000.0,2014-05-08,0,Car purchase,13.0,2016-01-25,NaN
2,2,11150.0,8.5100,A,Statistician,<=5 years,RENT,69840.0,2013-10-26,0,Debt consolidation,8.0,2014-09-26,NaN
3,3,7600.0,5.8656,A,Other,<=5 years,RENT,100386.0,2015-08-20,0,Debt consolidation,20.0,2016-01-26,NaN
4,4,31960.0,18.7392,E,Bus driver,>5 years,RENT,95040.0,2014-07-22,0,Debt consolidation,14.0,2016-01-11,NaN

In [17]:
data.shape

(10000, 14)

In [18]:
#Variables -> Numerical and Categorical
#Numerical
    # Discrete
    # Continuous
    
#Categorical
    # Nominal - Names
    # Ordinal -

In [19]:
#Printing the continuous columns
data['disbursed_amount'].unique()

array([23201.5 ,  7425.  , 11150.  , ...,  6279.  , 12894.75, 25584.  ])

In [20]:
#Print Categorical values 
data['householder'].unique()

array(['RENT', 'OWNER', 'MORTGAGE'], dtype=object)

In [21]:
data['householder'].value_counts()

MORTGAGE    4957
RENT        4055
OWNER        988
Name: householder, dtype: int64

In [22]:
#Print Dates
data['date_issued'].dtypes

dtype('O')

In [25]:
data['date_issued_dt']=pd.to_datetime(data['date_issued'])

In [27]:
data['month'] = data['date_issued_dt'].dt.month

In [28]:
data['year'] = data['date_issued_dt'].dt.year

In [29]:
data['month'].value_counts()

10    1277
7     1066
11    1017
12     882
8      852
4      816
5      749
9      734
6      700
1      700
3      623
2      584
Name: month, dtype: int64

In [30]:
data['month']

0        6
1        5
2       10
3        8
4        7
        ..
9995     1
9996     3
9997     4
9998    11
9999     1
Name: month, Length: 10000, dtype: int64

In [31]:
data['year']

0       2013
1       2014
2       2013
3       2015
4       2014
        ...
9995    2010
9996    2015
9997    2015
9998    2014
9999    2015
Name: year, Length: 10000, dtype: int64

In [34]:
data['year'].value_counts()

2015    4619
2014    2748
2013    1512
2012     580
2011     276
2010     156
2009      68
2008      35
2007       6
Name: year, dtype: int64

In [35]:
data['date_issued_dt']

0      2013-06-11
1      2014-05-08
2      2013-10-26
3      2015-08-20
4      2014-07-22
          ...
9995   2010-01-14
9996   2015-03-20
9997   2015-04-03
9998   2014-11-23
9999   2015-01-19
Name: date_issued_dt, Length: 10000, dtype: datetime64[ns]

In [36]:
data['date_issued_dt'].value_counts()

2015-10-16    28
2015-10-21    27
2015-01-06    27
2015-10-06    26
2014-10-07    26
              ..
2010-07-23     1
2010-09-17     1
2012-11-26     1
2012-07-11     1
2012-01-01     1
Name: date_issued_dt, Length: 1642, dtype: int64